test/load/addReview.yml
config:
  target: 'https://noderestapp.azurewebsites.net'
  phases:
    - duration: 20
      arrivalRate: 5
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - post:
        url: "/addReview"
        json: 
          name: "kamal"
          place: "Martin Wickramasinghe House & Folk Museum"
          review: "best place"