test/load/loadTesting.yml
config:
  target: 'https://noderestapp.azurewebsites.net'
  phases:
    - duration: 20
      arrivalRate: 5
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/"
    - post:
        url: "/addReview"
        json: 
          name: "kamal"
          place: "galle fort"
          review: "best place"
    - post:
        url: "/planTrip"
        json: 
          place: "galle"
          days: "2"
          email: "kmal@gmail.com"
    - get:
        url: "/crawlNearestPlaces/polonnaruwa"
    - get:
        url: "/bestPlaces"
    - get:
        url: "/searchHotel/galle"
    - post:
        url: "/nearestHotels"
        json: 
          place: "galle"
          lat: "6.02"
          lng: "80.21"
    - get:
        url: "/placeReviews/ChIJJ84WO7pE-zoRfCsDs6KXScM" 
    - get:
        url: "/getPlace/polonnaruwa vatadage" 
    - get:
        url: "/getPlace/singlePlace/polonnaruwa vatadage"      
    - get:
        url: "/myTrips/dilshan.saps@gmail.com"