test/load/nearestHotels.yml
config:
  target: 'https://noderestapp.azurewebsites.net'
  phases:
    - duration: 20
      arrivalRate: 5
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - post:
        url: "/nearestHotels"
        json: 
          place: "galle"
          lat: "6.02"
          lng: "80.21"